package Lessons28;

public class Test {
    public int id;
    public static void main(String[] args) {
        // public (Можно получить доступ к нему в любом другом классе и пакете)
        // private (можно получить доступ только в пределах класса где это поле задекларированно)
        // default (Всё что default доступно в пределах этого пакета.),
        // protected (Доступны в пределах одного пакета, доступны всем подклассам даже если эти подклассы вне пакета)
        // это модификаторы доступа в Java
    }
}
